//---------------------------1_
// alert("First JS");
//  var firstName = "Vasya", lastName = "Pupkin", age = 29,
// year = "2023",d=35 ;
// const img = ['1',''];
// console.log(img);
// img[0] = ['22'];
// console.log(img);
//     // alert(firstName+ " " + lastName+ " " + age);   //use + not ,   
//     // alert(age+4);

//     //var - много раз 
//     // - один раз
//     var number=1.23e4
//     console.log(number);
//     console.log(document.getElementsByTagName('p'));
    
//---------------------------2_
// let num=12;
// var boyName = "Nikita";
// const poem = "Мороз и солнце - т\n\
// День чудесный, " + {boyName} +".\
// Ещё ты \' дремлешь,\' \n друг прелес\t\
// nн\tый,"+{boyName}+".";
// alert(poem);

// const poem1 = `Мороз и солнце - т\n\
// День чудесный.\
// Ещё ты \' дремлешь,\' \n друг прелесnный.`; //  ` =>обратные ковычки тоже работают!
// alert(poem1);

// var girlName = "Nastya";
// const poem3 = `Мороз и солнце - т\n\
// День чудесный,${girlName}.\
// Ещё ты \' дремлешь,\' \n друг прелесnный,${girlName}.`;
// // alert(poem3);
// // console.log(typeof poem,typeof num,typeof poem3); //НУЖНЫ '\' !!! or '\n\'

// const person = {  
//     name: "Julia",
//       age: 23, 
//      email: "julia1987@gmail.com"
//     }
// console.log(person["age"]);
// alert(person.email);
// person.skills = ["HTML", 'CSS', "JavaScript"];
// console.log(person);
//возведение в степень "var s = 12**2;"
/*
Присваивание с умножением	x *= y	аналогично x = x * y
Присваивание с делением	x /= y	аналогично x = x / y
console. log(true == 1); // true

*/
// let num1=parseFloat(prompt("Input number:","45")); 
// //теперь это число '+' или '1*' (или '/1') bkb Number(...)
// let num2=parseInt (prompt("Input number:","9"));
// //parseInt все в int
// //parseFloat все в float
// console.log(num1,num2);
// console.log(num1+"+"+num2, num1 + num2);
// console.log(num1+"-"+num2,num1-num2);
// console.log(num1+"/"+num2,num1/num2);
// //NAN -> not a number

let price=8000;
let nal =10;
let nalmin= nal/100;
let shop =490;
let bank =500;
let husband= 0.5;
let nowm;
 nowm= ((1-husband)*(price-(price*nalmin)-(shop+bank)));
 console.log(nowm);
//-----------------------------3_
// var girlName="Стефанія";
// var lili="Люлі";
// var tx="Стефанія мамо, мамо Стефанія\n\
// Розквітає поле, а вона сивіє\n\
// Заспівай мені, мамо, колискову\n\
// Хочу ще почути твоє рідне слово";
// var  text =
// `${tx}
// Вона мене колисала, дала мені ритм
// І, напевне, силу волі не забрати в мене, бо дала вона
// Напевне, знала, може, більше і від Соломона
// Ломаними дорогами прийду я завжди до тебе
// Вона не розбудить, не будить, мене в сильні бурі
// Забере в бабулі дві дулі, ніби вони кулі
// Дуже добре знала мене, не була обманута
// Як була дуже втомлена, гойдала мене в такт
// ${lili}, ${lili}, ${lili}, гой!

// ${tx}\n
// Я не в пеленах, но ма, но ма, хватить
// Як би я не виріс, на виріст за речі платить
// Я не мала дитина, вона далі нерви тратить
// Я гуляв, шляк би тебе трафив!
// Ти все молода, о мамо, на піку
// Якщо не ціню опіку на піку слави, мені в тупіку
// Забивайте піку, цю піку, я би попік, спік, своєю любов'ю
// ${lili}, ${lili}, ${lili}, гой!

// ${tx}\n
// ${tx}\n `;
// alert(text);
//-----2---
// var girlName="Стефанія";    
// var lili="Люлі";
// var tx="Стефанія мамо, мамо Стефанія\n\
// Розквітає поле, а вона сивіє\n\
// Заспівай мені, мамо, колискову\n\
// Хочу ще почути твоє рідне слово";
// var  text =

//  tx
//  +"Вона мене колисала, дала мені ритм\n\
// І, напевне, силу волі не забрати в мене, бо дала вона\n\
// Напевне, знала, може, більше і від Соломона\n\
// Ломаними дорогами прийду я завжди до тебе\n\
// Вона не розбудить, не будить, мене в сильні бурі\n\
// Забере в бабулі дві дулі, ніби вони кулі\n\
// Дуже добре знала мене, не була обманута\n\
// Як була дуже втомлена, гойдала мене в такт\n\
// "+lili+","+ lili+","+ lili+", гой!"+

// tx
// +"Я не в пеленах, но ма, но ма, хватить\n\
// Як би я не виріс, на виріст за речі платить\n\
// Я не мала дитина, вона далі нерви тратить\n\
// Я гуляв, шляк би тебе трафив!\n\
// Ти все молода, о мамо, на піку\n\
// Якщо не ціню опіку на піку слави, мені в тупіку\n\
// Забивайте піку, цю піку, я би попік, спік, своєю любов'ю \n"+

// lili+","+lili+","+lili+",гой!\n"+ tx+"\n"+
// tx;
// alert(text);