alert("HOI!");
var text_Push = 
"Унылая пора! Очей очарованье!\n\
Приятна мне твоя прощальная краса —\n\
Люблю я пышное природы увяданье,\n\
В багрец и золото одетые леса.\n\
А. С. Пушкин\n";
alert(text_Push);

let iva ="Пойте про иву зеленую! \n";
let iva_1 ="Пойте про иву, про иву, про иву!\n";
var text_1 = 
'В тени сикомора бедняжка сидела, вздыхала, \n\
 '+iva+' Рука на груди, голова на коленях лежала,\n\
 '+ iva_1+ 'Струи свежих вод перед ней ее пени роптали,\n\
' + iva_1;

var text_2 = 
`Горючие капали слезы, и камни смягчали,
${iva_1}
Пойте: должна быть венком мне зеленая ива!
Шекспир`;

alert(text_1+'\n'+text_2);